Show / Hide Table of Contents
Class CoordSystemByZup
Coordinates system based on local Z axis up In case local X is vertical then Y local axis follows Y global axis.
Inheritance
System.Object
OpenObject
CoordSystem
CoordSystemByZup
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Geometry3D
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.Geometry3D.CoordSystemByZup,CI.Geometry3D")]
public class CoordSystemByZup : CoordSystem
 Improve this Doc
 View Source